Revit 2026 API

# RebarShapeDefinitionBySegmentsSetSegmentVariableDirection Method

---

Remove the fixed direction from a segment.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSegmentVariableDirection(
	int iSegment
)
```
```vb
Public Sub SetSegmentVariableDirection (
	iSegment As Integer
)
```
```cpp
public:
void SetSegmentVariableDirection(
	int iSegment
)
```
```fsharp
member SetSegmentVariableDirection :
        iSegment : int -> unit
```

#### Parameters

iSegment Int32
     Index of the segment (0 to NumberOfSegments - 1).

| Exception | Condition |
| --- | --- |
| ArgumentException | iSegment is not between 0 and NumberOfSegments. |

The segment's angle will be allowed to vary, with a range of 90 degrees. The segment must have at least two constraints.

#### Reference

RebarShapeDefinitionBySegments Class

Autodesk.Revit.DB.Structure Namespace